Revit 2025 API
ControlShape Enumeration
An enumerated type listing four shapes of control that Autodesk Revit supports.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ControlShape
Public Enumeration ControlShape
public enum class ControlShape
type ControlShape
Members
Member name | Value | Description
VerticalArrow | 0 | Vertical arrow.
HorizontalArrow | 1 | Horizontal arrow.
DoubleVerticalArrow | 2 | Double vertical arrow.
DoubleHorizontalArrow | 3 | Double horizontal arrow.
See Also
Reference
Autodesk.Revit.DB Namespace